import { Component} from '@angular/core';

@Component({
    templateUrl: './aboutUs.component.html',
    styleUrls: ['./aboutUs.component.css']
})
export class AboutUsComponent 
{
    public maintitle: string = 'Про нас';

    public title1: string = 'Що ми робимо?';
    public title2: string = 'Як ми це робимо?';
    public title3: string = 'Навіщо ми це робимо?';
    public title4: string = 'Наша політика';

    public text1_1: string = 'надаємо студентам можливість швидко і легко розбиратись з роботами.';
    public text1_2: string = 'створюємо альтернативу недосконалим методичкам і кострубатим поясненням.';
    public text1_3: string = 'даємо змогу заробляти за умови, що у вас є кілька вільних годин, знання і бажання допомогти іншим.';
    public text1_4: string = 'є ресурсом, що дозволяє ділитись досвідом, питаннями та вирішенням проблем.';

    public text2_1: string = 'кожен користувач сайту після швидкої і безболісної реєстрації має змогу скачати роботу, заплативши за неї певну суму чи викласти на ресурс свою власну творчість.';
    public text2_2: string = 'рейтинг запобігає встановленню захмарних цін чи впарюванню неякісних робіт. Ми твердо говоримо: обманам – ні.';
    public text2_3: string = 'проста і повна довідка допоможе розібратись з усіма непорозуміннями між сайтом і клієнтом.';

    public text3_1: string = 'місту потрібен його герой.';
    public text3_2: string = 'найгірші таймкілери – незрозумілі завдання з нульовим рівнем корисності, боротись з цим – необхідно.';
    public text3_3: string = 'чому б не почати досвід роботи з допомоги іншим?';
    public text3_4: string = 'єдність і взаємодопомога породжує рішення проблем.';

    public text4_1: string = 'конфіденційності – так.';
    public text4_2: string = 'мату – ні.';
    public text4_3: string = 'будь-якому виду образ – ні.';
    public text4_4: string = 'обману – ні.';
    public text4_5: string = 'неадекватній ціновій політиці – ні.';
    public text4_6: string = 'порушення цих пунктів в описах робіт чи будь-де-інде карається довічним баном.';
    public text4_7: string = 'ми бажаємо вам крекерів та легких лабок.';
 
}


