import { Component} from '@angular/core';

@Component({
    templateUrl: './help.component.html',
    styleUrls: ['./help.component.css']
})
export class HelpComponent 
{
    public maintitle: string = 'Довідка';

    public description: string = 'Якщо у Вас виникли проблеми із користуванням сайтом, ласкаво просимо у цей розділ, який допоможе знайти рішення проблем та і далі з успіхом здавати не-зовсім-свої лаби або заробляти гроші на допомозі бідним студентам.';

    public subtitle: string = 'Основні питання.';

    public point1: string = 'Не можете додати лабораторну?';
    public point2: string = 'Проблеми з пошуком лабораторної?';
    public point3: string = 'Не виходить скачати лабораторну?';
    public point4: string = 'Проблеми із купівлею лабораторної? Мій баланс.';
    public point5: string = 'Мій кошик – смітничка чи що?';
    public point6: string = 'Мій кабінет, моя фортеця.';
    public point7: string = 'Рейтинг.';
    public point8: string = 'Коментарі та відгуки.';
    public point9: string = 'Няшні діаграмки або Моя статистика.';
    public point10: string = 'Профілі користувачів.';
    public point11: string = 'Є ще питання?';

    public here: string = 'сюди';
    public myCabinet: string = 'мій кабінет';
    public mineCabinet: string = 'мого кабінету';
    public theme1_part1: string = 'Немає часу розбиратись, просто клікніть ';
    public theme1_part2: string = ' місту потрібен його герой. Після заповнення всіх необхідних полів та додавання хоча б одного файлу, автоматично будуть зроблені скріншоти робіт у співвідношенні: на 2 сторінки – 1 скріншот.Давайте якомога повніший опис роботи, це вигідніше для вас.';
    public theme2_part1: string = 'Переходьте ';
    public theme2_part2: string = ' і насолоджуйтесь. Введена фраза розбивається на ключові слова – теги, по яким і здійснюється пошук.';
    public theme3_part1: string = 'Після знаходження потрібної роботи, клікніть на її шапку і оберіть «додати в корзину», просто ніби в супермаркеті! Подальші дії очевидні: перейти у ';
    public theme3_part2: string = ' і здійснити покупку.';
    public theme4_part1: string = 'Цифри та значок гривні біля фотографії вашого профілю - це ваш грошовий баланс, необхідний, щоб купити лабу. Для поповнення балансу, перейдіть у ';
    public theme4_part2: string = ' . Після купівлі роботи, гроші за неї будуть зняті з балансу, а робота завантажена.';
    public theme5: string = 'Це місце, де зберігаються лабораторні, що були обрані, але ще не куплені. Впевнившись, що вам точно потрібна та писанина, клікніть по зображенню кошика біля вашого імені та аватарки на головній панелі і розберіться з обраними роботами – придбайте або видаліть з кошика.';
    public theme6_part1: string = 'Клікнувши по аватарці чи вашому імені на головній панелі, ви переходите до '; 
    public theme6_part2: string = ' де можна редагувати особисту інформацію, додати нові роботи чи переглянути скачені.';
    public theme7: string = 'Зірочки біля вашого імені та аватарки це не просто прикраса, а ваш особистий рейтинг, на який впливають користувачі, з якими ви мали справу. Ви також маєте змогу поставити оцінку автору лабораторної після скачування чи додати коментар стосовно неї.';
    public theme8: string = 'Після додання певної роботи до кошика, користувач може залишити коментар стосовно неї та поставити автору бали, що впливатимуть на його рейтинг. Крім того, є можливість залишити відгук про кожного автора чи покупця у його особистому профілі. Потрапити в особистий профіль користувача легко - просто клікайте по аватарці.';
    public theme9_part1: string = 'Перейшовши до ';
    public theme9_part2: string = ' та клікнувши на кнопку "моя статистика", можна побачити різноманітні графіки, що відображають вашу активність, витрати та прибутки, а також відомості про користувачів, які скачують ваші роботи. Цікаво і корисно, чи не так?';
    public theme10: string = 'Кожний користувач сайту після реєстрації має свій особистий профіль, де відображена найважливіша інформація про нього, а також та, що може ціквити бажаючих сконтактувати: нік, аватарка, завантажені та скачені лаби, рейтинг, відгуки інших користувачів. Потрапити в особистий профіль користувача легко - просто клікайте по аватарці.';
    public theme11_part1: string = 'Якщо вас цікавлять інші питання, переходьте ';
    public theme11_part2: string = ' та залишайте нам повідомлення. Задавайте своє питання якомога чіткіше, тоді і відповідь не змусить себе довго чекати :)';
}


